src/InformationRegisters/ОписаниеНоменклатурыИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатурыИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕмкостьПотребительскойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВПотребительскойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантЧастичногоВыбытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияЕдиницыХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияЕдиницыХраненияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотребительскаяУпаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпаковкаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникОписанияНоменклатурыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ОсобенностиУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОсобенностиУчетаНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезОсобенностейУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержитДрагоценныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КиЗГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизациейПродавцом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизациейПоАгентскойСхеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Партнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбувнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МясоПодконтрольноеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияДо9Процентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПивоВПотребительскихУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КассыККМ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКассККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазъезднаяТорговля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДоговорыЭквайринга</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьПлатежиБезУказанияЗаявок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоддерживаетОплатуЭСФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/СобытияФормЛокализация/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на сервере
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от создания формы.
//  СтандартнаяОбработка	- Булево - признак выполнения стандартной (системной) обработки события
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	//++ Локализация
	СобытияФормИС.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Если ЗначениеЗаполнено(Форма.Объект.ОсобенностьУчета) Тогда
			Форма.Элементы.КодТНВЭД.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента" Тогда
		ИнтеграцияИСУТ.ДобавитьЭлементыНастройкиВидаУпаковокПриСоздании(Форма);
		ИнтеграцияИСУТ.ЗаполнитьЗначениеПолейПоВидамУпаковок(Форма);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.КассыККМ.Форма.ФормаЭлемента" Тогда
		РозничныеПродажиЛокализация.КассаККМНастроитьВидимостьЭлементовОплатыЭСФСС(Форма);
		РозничныеПродажиЛокализация.КассаККМЗаполнитьПараметрыПодключенияНСПК(Форма);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаЭлемента" Тогда
		РозничныеПродажиЛокализация.ОрганизацияНастроитьВидимостьЭлементовОплатыЭСФСС(Форма);
		РозничныеПродажиЛокализация.ОрганизацияЗаполнитьПараметрыПодключенияНСПК(Форма);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.ЭквайринговыеТерминалы.Форма.ФормаЭлемента" Тогда
		РозничныеПродажиЛокализация.ЭквайринговыйТерминалНастроитьВидимостьЭлементовОплатыЭСФСС(Форма);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ОтчетКомиссионера.Форма.ФормаДокумента" Тогда
		Если ИнтеграцияСМаркетплейсамиСерверЛокализация.ИспользуетсяИнтеграцияСМаркетплейсами() Тогда
			Форма.Элементы.ТоварыГруппаДанныеДокументаОтгрузки.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
		ИЛИ Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" Тогда
		РозничныеПродажиЛокализация.УстановитьФункциональнуюОпциюОплатаЭСФСС(Форма);
		РозничныеПродажиЛокализация.УстановитьВозможностьИспользованиеОплатыСБПНаФормахРМК(Форма);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.РеализацияПодарочныхСертификатов.Форма.ФормаДокументаРМК"
		ИЛИ Форма.ИмяФормы = "Документ.ВозвратПодарочныхСертификатов.Форма.ФормаДокументаРМК" Тогда
		РозничныеПродажиЛокализация.УстановитьВозможностьИспользованиеОплатыСБПНаФормахРМК(Форма);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Перечисление.ТипыНоменклатуры.Форма.ВыборТипаНоменклатуры" Тогда
		Если ИнтеграцияГИСМ.ПодсистемаНеИспользуется() Тогда
			Если Форма.ОсобенностьУчета <> Перечисления.ОсобенностиУчетаНоменклатуры.КиЗГИСМ Тогда
				Форма.Элементы.ОсобенностьУчетаКиЗГИСМ.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.СертификатыНоменклатуры.Форма.ФормаСпискаКонтекст" Тогда
		ИнтеграцияСМаркетплейсамиСервер.ПриСозданииФормыСпискаКонтекстСертификатовНоменклатуры(Форма);
	КонецЕсли;
	
	Если Форма.Параметры.Свойство("ДополнительныеСвойстваДинамическихСписков")
		И ИнтеграцияСМаркетплейсамиСерверЛокализация.ИспользуетсяИнтеграцияСМаркетплейсами() Тогда
		ИнтеграцияСМаркетплейсамиСерверЛокализация.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	КонецЕсли;

	ИнтеграцияИСМПУТ.ДобавитьЭлементСостояниеГИСМТПриСоздании(Форма);
	
	ОформлениеПередачиТоваровМеждуОрганизациямиСервер.ПриСозданииНаСервере(Форма);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	ТекущийОбъект			- СправочникОбъект, ДокументОбъект - объект, который будет прочитан.
//	ДополнительныеПараметры - Структура - дополнительные параметры.
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры = Неопределено) Экспорт
	
	//++ Локализация
	СобытияФормИС.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	ОформлениеПередачиТоваровМеждуОрганизациямиСервер.ПриЧтенииНаСервере(Форма);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект, Отказ, ПараметрыЗаписи) Экспорт

	//++ Локализация
	
	//-- Локализация
	Возврат;

КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от записи из формы.
//	ТекущийОбъект			- СправочникОбъект, ДокументОбъект - записываемый объект.
//	ПараметрыЗаписи			- Структура - дополнительные параметры записи.
//
Процедура ПриЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	//++ Локализация
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента" Тогда
		ИнтеграцияИСУТ.ЗаписатьДанныеПоВидамУпаковок(Форма, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.КассыККМ.Форма.ФормаЭлемента" Тогда
		РозничныеПродажиЛокализация.КассаККМЗаписатьПараметрыПодключенияНСПК(Форма, ТекущийОбъект);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаЭлемента" Тогда
		РозничныеПродажиЛокализация.ОрганизацияЗаписатьПараметрыПодключенияНСПК(Форма, ТекущийОбъект);
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	ТекущийОбъект			- СправочникОбъект, ДокументОбъект - объект, который будет прочитан.
//	ДополнительныеПараметры - Структура - дополнительные параметры.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры = Неопределено) Экспорт
	
	//++ Локализация
	СобытияФормИС.ПослеЗаписиНаСервере(Форма);
	ОформлениеПередачиТоваровМеждуОрганизациямиСервер.ПослеЗаписиНаСервере(Форма);
	
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Если ЗначениеЗаполнено(Форма.Объект.ОсобенностьУчета) Тогда
			Форма.Элементы.КодТНВЭД.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		Иначе
			Форма.Элементы.КодТНВЭД.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;
		КонецЕсли;
		
	КонецЕсли;
	
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от успешной проверки заполнения.
//	ПроверяемыеРеквизиты	- Массив из Строка - Проверяемые реквизиты.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	//++ Локализация
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента" Тогда
		ИнтеграцияИСУТ.ПроверкаЗаполненияПоВидамУпаковок(Форма, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#Область СобытияЭлементовФорм

// Серверная переопределяемая процедура, вызываемая из обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Строка           - имя элемента-источника события "При изменении"
//   ДополнительныеПараметры - Произвольный     - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	СобытияФормИС.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
	
	Если Элемент = "СмТакжеВРаботе" Тогда
		Если ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции")
			Или ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП")
			Или ПолучитьФункциональнуюОпцию("ВестиУчетПестицидовАгрохимикатовТукосмесейСАТУРН")
			Или ПолучитьФункциональнуюОпцию("ВестиУчетЗернаИПродуктовПереработкиЗЕРНО")
			Или ПолучитьФункциональнуюОпцию("ВестиУчетПодконтрольныхТоваровВЕТИС")
		Тогда
			ДополнительныеПараметры.Добавить("Обработка.ОформлениеПередачиТоваровМеждуОрганизациями");
		КонецЕсли;
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Серверная переопределяемая процедура, вызываемая из обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Строка           - имя элемента-источника события "При изменении"
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриСменеСтраницФормы(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС")
		И Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
		
		Если Форма.ИмяФормы = "Документ.АктОРасхожденияхПослеПриемки.Форма.ФормаДокумента"
			И Элемент = "ГруппаСтраницы" 
			И Форма.Элементы.ГруппаСтраницы.ТекущаяСтраница = Форма.Элементы.СтраницаОсновное Тогда
			
			ИнтеграцияИСМПУТКлиентСервер.ДополнитьНадписьСпособаОтраженияРасхождений(
				ТипЗнч(Форма.Объект.Ссылка),
				Форма.Элементы.НадписьРасхождения,
				Форма.Элементы.ОформитьДокументы,
				Форма.Объект.Товары,
				Форма.Объект.ШтрихкодыУпаковокРасхождения);
			
		ИначеЕсли Форма.ИмяФормы = "Документ.АктОРасхожденияхПослеОтгрузки.Форма.ФормаДокумента"
			И Элемент = "ГруппаСтраницы" 
			И Форма.Элементы.ГруппаСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаОсновное
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТребуетсяОбработкаКодовМаркировки")
			И Форма.ТребуетсяОбработкаКодовМаркировки Тогда
			
			ИнтеграцияИСМПУТКлиентСервер.ДополнитьНадписьСпособаОтраженияРасхождений(
				ТипЗнч(Форма.Объект.Ссылка),
				Форма.Элементы.НадписьРасхождения,
				Форма.Элементы.ОформитьДокументы);
				
		КонецЕсли;
		
	КонецЕсли;
	
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Серверная переопределяемая процедура обработки добавляемой команды
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   ДополнительныеПараметры - Структура        - параметры вызова команды.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	Если ДополнительныеПараметры.Свойство("ИмяКоманды")
		И ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьПоДокументамМаркировки" Тогда
		
		ИмяТабличнойЧастиТовары = "ВыходныеИзделия";
		ИмяТабличнойЧастиСерии = "ВыходныеИзделияСерии";
		Если Форма.ИмяФормы = "Документ.ПрочееОприходованиеТоваров.Форма.ФормаДокумента" Тогда
			ИмяТабличнойЧастиТовары = "Товары";
			ИмяТабличнойЧастиСерии = "Серии";
		КонецЕсли;
		Товары = Форма.Объект[ИмяТабличнойЧастиТовары].Выгрузить();
		Серии = Форма.Объект[ИмяТабличнойЧастиСерии].Выгрузить();
		ТабличнаяЧастьШтрихкодыУпаковокЗаполнена = Форма.Объект.ШтрихкодыУпаковок.Количество() > 0;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДополнительныеПараметры.ДанныеВыбора);
		Запрос.УстановитьПараметр("Товары", Товары);
		
		СписокЗапросов = Новый СписокЗначений();
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия КАК Серия,
		|	Таблица.Количество КАК Количество,
		|	Таблица.КоличествоУпаковок КАК КоличествоУпаковок,
		|	&ТребуетВзвешивания КАК ТребуетВзвешивания
		|ПОМЕСТИТЬ Маркировано
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.Товары КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО &ТоварыОписаниеНоменклатурыИС
		|ГДЕ
		|	Таблица.Ссылка В (&Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Серия КАК Серия,
		|	Таблица.Количество КАК Количество,
		|	Таблица.Количество КАК КоличествоУпаковок,
		|	&ТребуетВзвешивания КАК ТребуетВзвешивания
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО &ТоварыОписаниеНоменклатурыИС
		|ГДЕ
		|	Таблица.Ссылка В (&Ссылка)
		|	И Таблица.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|";
		ОбщегоНазначенияИС.ОбновитьТекстЗапросаСРегистромОписаниеНоменклатурыИС(ТекстЗапроса, "ОписаниеНоменклатурыИС", "Таблица.Номенклатура");
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
		СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	Маркировано.Номенклатура КАК Номенклатура,
		|	Маркировано.Характеристика КАК Характеристика,
		|	Маркировано.Серия КАК Серия,
		|	СУММА(Маркировано.Количество) КАК Количество,
		|	СУММА(Маркировано.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	МАКСИМУМ(Маркировано.ТребуетВзвешивания) КАК ТребуетВзвешивания
		|ПОМЕСТИТЬ ФактическиМаркировано
		|ИЗ
		|	Маркировано КАК Маркировано
		|СГРУППИРОВАТЬ ПО
		|	Маркировано.Номенклатура,
		|	Маркировано.Характеристика,
		|	Маркировано.Серия
		|");
		
		СписокЗапросов.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФактическиМаркировано.Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета
		|ПОМЕСТИТЬ ВыбранныеОсобенностиУчета
		|ИЗ
		|	ФактическиМаркировано КАК ФактическиМаркировано
		|");
		
		СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Характеристика КАК Характеристика,
		|	ТЗ.Серия КАК Серия
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК ТЗ
		|");
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия КАК Серия,
		|	&ТребуетВзвешивания КАК ТребуетВзвешивания
		|ИЗ
		|	Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОсобенностиУчета КАК ВыбранныеОсобенностиУчета
		|		ПО Товары.Номенклатура.ОсобенностьУчета = ВыбранныеОсобенностиУчета.ОсобенностьУчета
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО &ТоварыОписаниеНоменклатурыИС
		|";
		ОбщегоНазначенияИС.ОбновитьТекстЗапросаСРегистромОписаниеНоменклатурыИС(ТекстЗапроса, "ОписаниеНоменклатурыИС", "Товары.Номенклатура");
		СписокЗапросов.Добавить(ТекстЗапроса, "ИзменяемыеСтрокиТЧТовары");
		
		СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ФактическиМаркировано.Номенклатура КАК Номенклатура,
		|	ФактическиМаркировано.Характеристика КАК Характеристика,
		|	ФактическиМаркировано.Серия КАК Серия,
		|	ФактическиМаркировано.Количество КАК Количество,
		|	ФактическиМаркировано.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЛОЖЬ КАК Обработано
		|ИЗ
		|	ФактическиМаркировано КАК ФактическиМаркировано
		|", "НовоеЗначениеКоличества");
		
		РезультатЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
		
		//@skip-warning
		ИзменяемыеСтрокиТЧТовары = РезультатЗапроса["ИзменяемыеСтрокиТЧТовары"].Выгрузить();
		//@skip-warning
		НовоеЗначениеКоличества = РезультатЗапроса["НовоеЗначениеКоличества"].Выгрузить();
		
		КлючПоиска = Новый Структура("Номенклатура,Характеристика,Серия");
		КлючПоискаБезСерии = Новый Структура("Номенклатура,Характеристика");
		Товары.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Булево"));
		Серии.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Булево"));
		Для Каждого СтрокаТЧ Из Товары Цикл
			
			Если СтрокаТЧ.Удалить Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(КлючПоиска, СтрокаТЧ);
			ЗаполнитьЗначенияСвойств(КлючПоискаБезСерии, СтрокаТЧ);
			ИзменяютсяСтрокиТЧТовары = ИзменяемыеСтрокиТЧТовары.НайтиСтроки(КлючПоиска);
			СтрокаИзменяется = ИзменяютсяСтрокиТЧТовары.Количество();
			Если Не СтрокаИзменяется Тогда
				Продолжить;
			ИначеЕсли ТабличнаяЧастьШтрихкодыУпаковокЗаполнена И ИзменяемыеСтрокиТЧТовары[0].ТребуетВзвешивания Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
				НовоеКоличество = НовоеЗначениеКоличества.НайтиСтроки(КлючПоиска);
			Иначе
				НовоеКоличество = НовоеЗначениеКоличества.НайтиСтроки(КлючПоискаБезСерии);
			КонецЕсли;
			СтрокиСерии = Серии.НайтиСтроки(КлючПоискаБезСерии);
			Если НовоеКоличество.Количество() = 0 Тогда
				СтрокаТЧ.Удалить = Истина;
				Продолжить;
			КонецЕсли;
			Для Каждого Серия Из СтрокиСерии Цикл
				Серия.Удалить = Истина;
			КонецЦикла;
			Коэффициент = СтрокаТЧ.КоличествоУпаковок / СтрокаТЧ.Количество;
			СтрокаТЧ.Количество = 0;
			Для Каждого СтрокаМаркировано Из НовоеКоличество Цикл
				СтрокаМаркировано.Обработано = Истина;
				СтрокаТЧ.Количество = СтрокаТЧ.Количество + СтрокаМаркировано.Количество;
				Если ЗначениеЗаполнено(СтрокаМаркировано.Серия) Тогда
					НоваяСтрокаСерия = Серии.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСерия, СтрокаТЧ);
					НоваяСтрокаСерия.Количество = СтрокаМаркировано.Количество;
				КонецЕсли;
			КонецЦикла;
			СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.Количество * Коэффициент;
			
			Для Каждого ДубльСтроки Из Товары.НайтиСтроки(КлючПоиска) Цикл
				Если ДубльСтроки <> СтрокаТЧ Тогда
					ДубльСтроки.Удалить = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Для Каждого СтрокаМаркировано Из НовоеЗначениеКоличества.НайтиСтроки(Новый Структура("Обработано", Ложь)) Цикл
			Если ТабличнаяЧастьШтрихкодыУпаковокЗаполнена И СтрокаМаркировано.ТребуетВзвешивания Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаТовары = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, СтрокаМаркировано);
		КонецЦикла;
		
		Форма.Объект[ИмяТабличнойЧастиТовары].Загрузить(Товары.Скопировать(Новый Структура("Удалить", Ложь)));
		Форма.Объект[ИмяТабличнойЧастиСерии].Загрузить(Серии.Скопировать(Новый Структура("Удалить", Ложь)));
		
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
